In [123]:
import pandas as pd
import matplotlib.pyplot as plt

In [124]:
df = pd.read_csv("life_expectancy.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    object
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(5)
memory usage: 4.8+ KB

In [125]:
df

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong *,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao *,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

In [126]:
df.head()

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong *,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao *,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰

In [127]:
df.tail()

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    object
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(5)
memory usage: 4.8+ KB

In [129]:
df["Country"]

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: object

In [130]:
df["Country"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 120 entries, 0 to 119
Series name: Country
Non-Null Count  Dtype
--------------  -----
120 non-null    object
dtypes: object(1)
memory usage: 1.1+ KB

In [131]:
df[["Country"]]

                   Country
0              Hong Kong *
1                  Macao *
2              Switzerland
3                  Iceland
4                   Norway
..                     ...
115  Congo (Dem. Republic)
116               Zimbabwe
117                Somalia
118                Nigeria
119                   Chad

[120 rows x 1 columns]

In [132]:
df[["Country"]].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  120 non-null    object
dtypes: object(1)
memory usage: 1.1+ KB

In [133]:
df["Country"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 120 entries, 0 to 119
Series name: Country
Non-Null Count  Dtype
--------------  -----
120 non-null    object
dtypes: object(1)
memory usage: 1.1+ KB

In [134]:
df.max()

Country                      Zimbabwe
Life expectancy males      83.2 years
Life expectancy females    87.9 years
Birth rate                      9.8 ‰
Death rate                      9.9 ‰
dtype: object

In [135]:
df.min()

Country                    Afghanistan
Life expectancy males       50.8 years
Life expectancy females     53.1 years
Birth rate                      10.0 ‰
Death rate                       1.3 ‰
dtype: object

# Data Cleaning

## Country

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    object
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(5)
memory usage: 4.8+ KB

In [136]:
df["Country"]

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: object

In [137]:
df[["Country"]]

                   Country
0              Hong Kong *
1                  Macao *
2              Switzerland
3                  Iceland
4                   Norway
..                     ...
115  Congo (Dem. Republic)
116               Zimbabwe
117                Somalia
118                Nigeria
119                   Chad

[120 rows x 1 columns]

Convert this to string datatype

In [138]:
df.describe()

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
count,120,120,120,120,120
unique,120,100,98,96,82
top,Hong Kong *,66.1 years,76.4 years,9.6 ‰,6.8 ‰
freq,1,3,3,4,5

In [139]:
df["Country"].astype("string")

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: string

In [140]:
df["Country"] = df["Country"].astype("string")

In [141]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    string
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(4), string(1)
memory usage: 4.8+ KB

In [142]:
df["Country"]

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: string

In [144]:
df["Country"] = df["Country"].str.strip(to_strip = " ")

In [145]:
df["Country"]

0                Hong Kong *
1                    Macao *
2                Switzerland
3                    Iceland
4                     Norway
               ...
115    Congo (Dem. Republic)
116                 Zimbabwe
117                  Somalia
118                  Nigeria
119                     Chad
Name: Country, Length: 120, dtype: string

## Finding Null Values

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  120 non-null    string
 1   Life expectancy males    120 non-null    object
 2   Life expectancy females  120 non-null    object
 3   Birth rate               120 non-null    object
 4   Death rate               120 non-null    object
dtypes: object(4), string(1)
memory usage: 4.8+ KB

In [146]:
df[df["Country"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

In [147]:
df[df["Life expectancy males"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

In [70]:
df[df["Life expectancy females"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

In [71]:
df[df["Birth rate"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

In [148]:
df[df["Death rate"].isna()]

Empty DataFrame
Columns: [Country, Life expectancy males, Life expectancy females, Birth rate, Death rate]
Index: []

## Changing Values 0 and 1

In [80]:
df.loc[[0], ["Country"]] = "Hong Kong"
df.loc[[0], ["Country"]]

     Country
0  Hong Kong

In [81]:
df.loc[[1], ["Country"]] = "Macao"
df.loc[[1], ["Country"]]

  Country
1   Macao

In [82]:
df

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰

## Now changing Life Expectency Both Values and Datatype

In [149]:
df.head()

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong *,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao *,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,Norway,81.7 years,84.7 years,10.4 ‰,7.8 ‰

In [150]:
df.replace("Norway", "This is the error")

,Country,Life expectancy males,Life expectancy females,Birth rate,Death rate
0,Hong Kong *,83.2 years,87.9 years,5.0 ‰,6.9 ‰
1,Macao *,82.8 years,87.9 years,10.1 ‰,4.1 ‰
2,Switzerland,81.9 years,85.9 years,10.3 ‰,8.2 ‰
3,Iceland,81.8 years,84.5 years,13.1 ‰,6.3 ‰
4,This is the error,81.7 years,84.7 years,10.4 ‰,7.8 ‰
...,...,...,...,...,...
115,Congo (Dem. Republic),57.0 years,61.5 years,42.0 ‰,9.7 ‰
116,Zimbabwe,56.2 years,62.0 years,30.5 ‰,9.1 ‰
117,Somalia,53.2 years,57.4 years,43.6 ‰,11.6 ‰
118,Nigeria,52.3 years,53.1 years,37.1 ‰,13.1 ‰
119,Chad,50.8 years,54.3 years,43.4 ‰,12.5 ‰